{
  "fog.datagen_warning.title": "§6§l§nWarning!§r",
  "fog.datagen_warning.message": "Fog has been updated, changing the default biome fog colors.\nPlease back up your changes to the `.minecraft/config/fog/fog_definitions` folder before deleting it to apply the new changes.\nThis will not be shown again. (Note: Pressing 'OK' will not delete the folder for you.)",
  "fog.config.category.fog_calculations": "Fog Calculations",
  "fog.config.option.fog_calculations.warning": "§6§l§nWarning!§r It is not recommended to touch these constants unless you understand what they do, and how they are used.\nConsider leaving them as-is for the best experience.",
  "fog.config.option.initial_fog_start": "Initial Fog Start",
  "fog.config.option.description.initial_fog_start": "The initial (when the fog engine is loaded) distance from the camera at which fog starts to appear - expressed as a percentage of view distance",
  "fog.config.option.initial_fog_end": "Initial Fog End",
  "fog.config.option.description.initial_fog_end": "The initial (when the fog engine is loaded) distance from the camera at which fog is fully opaque - expressed as a percentage of view distance",
  "fog.config.option.disable_raininess_effect": "Disable Raininess Effect",
  "fog.config.option.description.disable_raininess_effect": "Disables the raininess effect, which makes the fog appear more dense when it is raining",
  "fog.config.option.disable_underground_fog_multiplier": "Disable Underground Fog Multiplier",
  "fog.config.option.description.disable_underground_fog_multiplier": "Disables the underground fog multiplier, which makes the fog appear more dense and dark when the player is underground",
  "fog.config.option.disable_biome_fog_colour": "Disable Biome Fog Colour",
  "fog.config.option.description.disable_biome_fog_colour": "Disables the biome fog colour, which makes the fog colour change based on the biome the player is in",
  "fog.config.option.disable_haze_calculation": "Disable Haze Calculation",
  "fog.config.option.description.disable_haze_calculation": "Disables the haze calculation, haze is the change in the fog colour based on the time of day.",
  "fog.config.option.disable_nether": "Disable In Nether",
  "fog.config.option.disable_cloud_whitening": "Disable Cloud Whitening",
  "fog.config.option.description.disable_cloud_whitening": "Disables the cloud whitening effect, which unlinks cloud color from fog color. This is disabled when Sodium is present as Sodium does this by default.",
  "fog.config.option.description.disable_nether": "Disables the fog engine modifications in the Nether dimension - Vanilla does a pretty darn good job with the Nether biomes, there isn't a need to modify them.",
  "fog.config.option.disable_mod": "Disable Mod Entirely",
  "fog.config.option.description.disable_mod": "Disables the mod entirely, useful if you want to make comparisons to vanilla.",

  "fog.command.toggle.enabled": "Fog engine modifications have now been re-enabled.",
  "fog.command.toggle.disabled": "Fog engine modifications have now been disabled.",
  "fog.command.reset": "Fog engine modifications have been reloaded and reset to the default values specified in the config.",
  "fog.command.debug.failure": "An error occurred while getting debug information."
}
